----------------------Router 0 -------------------
Router>enable
Router#conf
Router#configure ter
Router#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#inte
Router(config)#interface gig
Router(config)#interface gigabitEthernet 0/0
Router(config-if)#ip address 192.168.10.1 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

Router(config-if)#inte
Router(config-if)#exit
Router(config)#inter
Router(config)#interface giga
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#ip address 192.168.20.1 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up

Router(config-if)#exit
Router(config)#inter
Router(config)#interface giga
Router(config)#interface gigabitEthernet 0/2
Router(config-if)#ip address 192.168.30.1 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/2, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/2, changed state to up

Router(config-if)#exit
Router(config)#do write memory
Building configuration...
[OK]
Router(config)#
Router(config)#router rip
Router(config-router)#network 192.168.10.0
Router(config-router)#network 192.168.20.0
Router(config-router)#network 192.168.30.0
Router(config-router)#do write memory
Building configuration...
[OK]
Router(config-router)#



--------------------Switch 0--------------------------------
Switch>enable
Switch#conf
Switch#configure ter
Switch#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#inter
Switch(config)#interface fast
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#swi
Switch(config-if)#switchport mode access
Switch(config-if)#swi
Switch(config-if)#switchport access vlan 10
% Access VLAN does not exist. Creating vlan 10
Switch(config-if)#exit
Switch(config)#int
Switch(config)#interface fast
Switch(config)#interface fastEthernet 0/2
Switch(config-if)#int
Switch(config-if)#swi
Switch(config-if)#switchport mode access
Switch(config-if)#swi
Switch(config-if)#switchport access vlan 20
% Access VLAN does not exist. Creating vlan 20
Switch(config-if)#exit
Switch(config)#int
Switch(config)#interface fas
Switch(config)#interface fastEthernet 0/3
Switch(config-if)#swi
Switch(config-if)#switchport mode acc
Switch(config-if)#switchport mode access 
Switch(config-if)#sw
Switch(config-if)#switchport access vlan 30
% Access VLAN does not exist. Creating vlan 30
Switch(config-if)#exit
Switch(config)#do write memory
Building configuration...
[OK]
Switch(config)#


----------------------------------Switch 1-----------------------------
Switch>enable
Switch#conf
Switch#configure ter
Switch#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#inter
Switch(config)#interface fast
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#swi
Switch(config-if)#switchport mode access
Switch(config-if)#swi
Switch(config-if)#switchport access vlan 10
Switch(config-if)#exit
Switch(config)#inte
Switch(config)#interface fas
Switch(config)#interface fastEthernet 0/2
Switch(config-if)#swi
Switch(config-if)#switchport mode access
Switch(config-if)#swi
Switch(config-if)#switchport access vlan 20
Switch(config-if)#exit
Switch(config)#int
Switch(config)#interface fas
Switch(config)#interface fastEthernet 0/3
Switch(config-if)#swi
Switch(config-if)#switchport mode access
Switch(config-if)#swi
Switch(config-if)#switchport access vlan 30
Switch(config-if)#exit
Switch(config)#do write memory
Building configuration...
[OK]
Switch(config)#

---------------------------Switch 2------------------------
Switch>enable
Switch#conf
Switch#configure ter
Switch#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Switch(config)#int
Switch(config)#interface fast
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#switchport mode access
Switch(config-if)#swi
Switch(config-if)#switchport access vlan 10
% Access VLAN does not exist. Creating vlan 10
Switch(config-if)#exit
Switch(config)#vlan show
                    ^
% Invalid input detected at '^' marker.
	
Switch(config)#vlan brief
                    ^
% Invalid input detected at '^' marker.
	
Switch(config)#inter
Switch(config)#interface fast
Switch(config)#interface fastEthernet 0/2
Switch(config-if)#swi
Switch(config-if)#switchport mode access
Switch(config-if)#swi
Switch(config-if)#switchport access vlan 20
% Access VLAN does not exist. Creating vlan 20
Switch(config-if)#exit
Switch(config)#int
Switch(config)#interface fast
Switch(config)#interface fastEthernet 0/3
Switch(config-if)#swi
Switch(config-if)#switchport mode access
Switch(config-if)#swi
Switch(config-if)#switchport access vlan 30
% Access VLAN does not exist. Creating vlan 30
Switch(config-if)#exit
Switch(config)#int
Switch(config)#interface fast
Switch(config)#interface fastEthernet 0/5
Switch(config-if)#swi
Switch(config-if)#switchport mode trunk

Switch(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/5, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/5, changed state to up

Switch(config-if)#exit
Switch(config)#do write memory
Building configuration...
[OK]
Switch(config)